# a = int(input('Enter first number : '))
# b = int(input('Enter second number : '))

# # Користувач вводить з клавіатури два числа.
# # Розрахуйте суму чисел, різницю чисел, добуток чисел.
# # Результати обчислень виведіть на екран.
# print(a + b)
# print(a - b)
# print(a * b)

# # Користувач вводить з клавіатури два числа.
# # Перше число — це значення, друге число — відсоток, який необхідно
# # підрахувати. Наприклад, ми ввели з клавіатури 50 та 10.
# # Виведіть на екран 10% від 50. Результат: 5
# print(a * b / 100)

# # Користувач вводить з клавіатури ширину та висоту прямокутника.
# # Напишіть програму, яка підраховує площу прямокутника.
# print(a * b)

# # fourth
# print("Anyone who\n stops\n  learning is old,\n   whether at twenty or eighty.\n\t\t    Henry Ford")

# # Користувач вводить з клавіатури двозначне число.
# # Наприклад, 26. Покажіть на різних рядках значення першого та
# # другого розряду. У нашому випадку це виглядатиме так:

number = int(input('Enter number : '))
print("result :", number // 10, "," , number % 10)
